load_tests/tsung.xml
<?xml version="1.0"?>
<!-- tsung path needed-->
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>


<load>
  <arrivalphase phase="1" duration="20" unit="second">
    <users arrivalrate="1" unit="second"></users>
  </arrivalphase>
  <arrivalphase phase="2" duration="20" unit="second">
    <users arrivalrate="2" unit="second"></users>
  </arrivalphase>
  <arrivalphase phase="3" duration="20" unit="second">
    <users arrivalrate="4" unit="second"></users>
  </arrivalphase>
  <arrivalphase phase="4" duration="20" unit="second">
    <users arrivalrate="8" unit="second"></users>
  </arrivalphase>
 </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <setdynvars sourcetype="random_number" start="0" end="499">
        <var name="user_id" />
      </setdynvars>

      <!-- User visits home/login page -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- User visits explore page -->
      <request>
        <http url='/app/explore' version='1.1' method='GET'></http>
      </request>

      <!-- User waits at login page for ~2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- User visits match page -->
      <request>
        <http url='/app/match' version='1.1' method='GET'></http>
      </request>

      <!-- User visits edit page -->
      <request>
        <http url='/app/edit' version='1.1' method='GET'></http>
      </request>



    </session>
  </sessions>
</tsung>